# SetLegendSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..SetLegendSettings Method
AnalysisDisplayStyle Class See Also
---
Set legend settings object for the style.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetLegendSettings(
	AnalysisDisplayLegendSettings legendSettings
)
```

Visual Basic
---
```text
Public Sub SetLegendSettings ( _
	legendSettings As AnalysisDisplayLegendSettings _
)
```

Visual C++
---
```text
public:
void SetLegendSettings(
	AnalysisDisplayLegendSettings^ legendSettings
)
```

# ### Parameters
legendSettings
    Type: Autodesk.Revit.DB.Analysis..::..AnalysisDisplayLegendSettings
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace